Tekla.Structures.ModelInternal.ConversionLink.ApprovalStatusEnum
Enum contains the all possible approval statuses.

Tekla.Structures.ModelInternal.ConversionLink.ApprovalStatusEnum.UNKNOWN
Approval status is Unknown.

Tekla.Structures.ModelInternal.ConversionLink.ApprovalStatusEnum.PENDING
Approval status is Pending.

Tekla.Structures.ModelInternal.ConversionLink.ApprovalStatusEnum.ACCEPTED
Approval status us Accepted.

Tekla.Structures.ModelInternal.ConversionLink.ApprovalStatusEnum.REJECTED
Approval status is Rejected.

Tekla.Structures.ModelInternal.ConversionLink.ApprovalStatusEnum.IGNORED
Approval status is Ignored.